doc/f2k3-lua-simple.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Fortran 2003 Lua - Simple API</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2011-05-03 00:12:40 CEST"/>
<meta name="author" content="Maik Beckmann &lt;beckmann.maik@googlemail.com&gt;"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" type="text/css" href="org-mode.css"/>
</head>
<body>
<div id="content">

<h1 class="title">Fortran 2003 Lua - Simple API</h1>


<p>
<div class="abstract">
This document shows how to use Lua for configuration files in a
Fortran 2003 program.  We start by instantiating a Lua VM, process a
file with a single line that assigns a number to a variable and get
this number in a Fortran REAL variable.  From there we successively
extend the lua script and learn how to deserialize lua data structures
into Fortran data structures.
</div>
</p>



<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Start and stop the Lua VM </a></li>
<li><a href="#sec-2">2 Feeding a file into the Lua VM </a></li>
<li><a href="#sec-3">3 The Lua Stack and how to get stuff from it </a>
<ul>
<li><a href="#sec-3_1">3.1 Stack basics </a></li>
<li><a href="#sec-3_2">3.2 Working with the Lua stack </a></li>
</ul>
</li>
<li><a href="#sec-4">4 Copyright and license of this document </a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Start and stop the Lua VM </h2>
<div class="outline-text-2" id="text-1">




<pre class="src src-f90"><span class="org-keyword">PROGRAM</span> <span class="org-function-name">noop</span>
  <span class="org-keyword">USE</span> <span class="org-function-name">f2k3_lua_simple</span>
  <span class="org-keyword">USE</span> <span class="org-function-name">ISO_C_BINDING</span>, <span class="org-keyword">ONLY</span>: <span class="org-constant">C_PTR</span>

  <span class="org-keyword">IMPLICIT</span> <span class="org-type">NONE</span>
  <span class="org-type">TYPE(C_PTR)</span> :: <span class="org-variable-name">luaState</span>

  <span class="org-keyword">CALL</span> <span class="org-function-name">luaL_newstate</span>(luaState)
  <span class="org-keyword">CALL</span> <span class="org-function-name">lua_close</span>(luaState)
<span class="org-keyword">END PROGRAM</span> <span class="org-function-name">noop</span>
</pre>


<p>
which can be compiled, given that you are in <code>test/</code> and the build
dir is <code>build/</code>
</p><pre class="example">
gfortran noop.f90 -o noop -I ../buid/include \
  -l lua -l f2k3_lua_simple -L ../../build/lib
</pre>

<p>If you run it via <code>./noop</code> nothing should happen, which means it at
least doesn't crash.
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Feeding a file into the Lua VM </h2>
<div class="outline-text-2" id="text-2">




<pre class="src src-f90"><span class="org-keyword">PROGRAM</span> <span class="org-function-name">dofile</span>
  <span class="org-keyword">USE</span> <span class="org-function-name">f2k3_lua_simple</span>
  <span class="org-keyword">USE</span> <span class="org-function-name">ISO_C_BINDING</span>, <span class="org-keyword">ONLY</span>: <span class="org-constant">C_PTR</span>

  <span class="org-keyword">IMPLICIT</span> <span class="org-type">NONE</span>
  <span class="org-type">TYPE(C_PTR)</span> :: <span class="org-variable-name">luaState</span>
  <span class="org-type">INTEGER</span> ::<span class="org-variable-name"> iostat, file_exists, error</span>
  <span class="org-type">CHARACTER</span>(len=4096) ::<span class="org-variable-name"> lua_error_msg = " "</span>
  <span class="org-type">REAL</span> ::<span class="org-variable-name"> val</span>

  <span class="org-keyword">CALL</span> <span class="org-function-name">luaL_newstate</span>(luaState)

  <span class="org-keyword">CALL</span> <span class="org-function-name">luaL_dofile</span>(luaState, <span class="org-string">"conf.lua"</span>, error)
  <span class="org-keyword">IF</span>(error &gt; 0) <span class="org-keyword">THEN</span>
    <span class="org-keyword">CALL</span> <span class="org-function-name">lua_tostring</span>(luaState, -1, lua_error_msg)
    <span class="org-keyword">PRINT</span> *, <span class="org-string">"[ERROR] Lua had problems processing the file:"</span>
    <span class="org-keyword">PRINT</span> *, <span class="org-keyword">TRIM</span>(lua_error_msg)
  <span class="org-keyword">END IF</span>

  <span class="org-keyword">CALL</span> <span class="org-function-name">lua_close</span>(luaState)
<span class="org-keyword">END PROGRAM</span> <span class="org-function-name">dofile</span>      
</pre>


<p>
You probaby wonder about <code>CALL lua_tostring(luaState, -1, lua_error_msg)</code>.  We'll get to this in the next section which is about
the Lua stack and how to get things it holds into a Fortran variable.
</p>
<p>
If we run <code>./dofile</code> and <code>conf.lua</code> contains valid Lua syntax, like
</p><pre class="example">
foo = "bar"
</pre>

<p>nothing will happen.  What's more interesting is what happens if Lua
has problems processing the file content.  If <code>conf.lua</code> contains
</p><pre class="example">
foo bar
</pre>

<p>the output is
</p><pre class="example">
[ERROR] Lua had problems processing this file:
val.lua:1: '=' expected near 'bar'
</pre>

<p>Note that Lua stops at the first error.  If a second invalid statement
is appended
</p><pre class="example">
foo bar
buzz lightyear
</pre>

<p>the output is still the same, since it doesn't even consider the
second one.
</p>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> The Lua Stack and how to get stuff from it </h2>
<div class="outline-text-2" id="text-3">


</div>

<div id="outline-container-3_1" class="outline-3">
<h3 id="sec-3_1"><span class="section-number-3">3.1</span> Stack basics </h3>
<div class="outline-text-3" id="text-3_1">

<p>So what is a stack?  I stack is simple way to store and manage data.
Let exercise what a stack can do.  At first it's empty
</p><pre class="example">
stack:
</pre>

<p>If we <b>push</b> an element `a' to the stack it'll show up
</p><pre class="example">
push a
stack: |a|
</pre>

<p>Now we <b>push</b> another two element `b' and `c' on it
</p><pre class="example">
push b
push c
stack: |a|b|c|
</pre>

<p>It works like stacking up a bunch of books.  Note that the last book
you put (or pushed) on the book stack is on top.  In line with this
analogy a non empty stack has always a <b>top</b> which holds the last
element that has been pushed to it.  To remove things from a stack you
<b>pop</b> the top
</p><pre class="example">
pop
stack: |a|b|
</pre>

<p>Given that the stack looks like this again
</p><pre class="example">
stack: |a|b|c|
</pre>

<p>and we want to remove the <code>a</code>.  What you have to do is
</p><pre class="example">
pop
stack: |a|b|
pop
stack: |a|
pop
stack:
push b
stack: |b|
push c
stack: |b|c|
</pre>

<p>Simple enough, but very verbose.  Moving elements in the stack around
is evidently a quite lenghty operation.  Which bares the question:
<span style="text-decoration:underline;">why</span> would anybody use a stack?  Why not a linked list where moving
elements around is efficient and just takes a few operations?  The
answer: A stack is as predictable as it gets.  If \(N\) parties
communicate via a stack all of them know that each of the other \(N-1\)
parties can just
</p><ol>
<li>push an element on the top
</li>
<li>pop the top element
</li>
</ol>

<p>and look at the top element, which doesn't alter the stack.  Imagine
that you are one of the parties and you'll get noticed everytime
someone did something to the stack.  You know where to look at: the
top.  If you'd got noticed that a linked list got changed, you'd
bascially had to look at all elements to know what has been done to
it.
</p>
<p>
A stack makes things simple and is also a good example for that simple
doesn't mean easy.
</p>
<p>
Stacks are usually part of the internals of a code base. not part of
an API.  Lua is quite unique in this. The upside is, again, that it
simplyfies things.  Not only is the behavior of a single function call
well definined, but also what happens between them.  There are no
hidden pointers used by some other code that might invalidate by
accident and make your program crash.  The downside, it's damn
stateful and hence hard to debug.  Givem a function you wrote ages ago
and it fails all the sudden.  You cannot just look at the values of
the arguments in a debugger.  You cannot put some asserts in place
that check if a pointer is properly set.  You always have to
introspect the stack.  This introspection code will make a huge chunk
of the code you'll write, as we are about to so see.
</p>
</div>

</div>

<div id="outline-container-3_2" class="outline-3">
<h3 id="sec-3_2"><span class="section-number-3">3.2</span> Working with the Lua stack </h3>
<div class="outline-text-3" id="text-3_2">




<pre class="src src-f90"><span class="org-keyword">PROGRAM</span> <span class="org-function-name">get_val</span>
  <span class="org-keyword">USE</span> <span class="org-function-name">f2k3_lua_simple</span>
  <span class="org-keyword">USE</span> <span class="org-function-name">ISO_C_BINDING</span>, <span class="org-keyword">ONLY</span>: <span class="org-constant">C_PTR</span>

  <span class="org-keyword">IMPLICIT</span> <span class="org-type">NONE</span>
  <span class="org-type">TYPE(C_PTR)</span> :: <span class="org-variable-name">luaState</span>
  <span class="org-type">INTEGER</span> ::<span class="org-variable-name"> iostat, file_exists, error</span>
  <span class="org-type">CHARACTER</span>(len=4096) ::<span class="org-variable-name"> lua_error_msg = " "</span>
  <span class="org-type">REAL</span> ::<span class="org-variable-name"> val</span>

  <span class="org-keyword">CALL</span> <span class="org-function-name">luaL_newstate</span>(luaState)

  <span class="org-keyword">CALL</span> <span class="org-function-name">luaL_dofile</span>(luaState, <span class="org-string">"conf.lua"</span>, error)
  <span class="org-keyword">IF</span>(error &gt; 0) <span class="org-keyword">THEN</span>
    <span class="org-keyword">CALL</span> <span class="org-function-name">lua_tostring</span>(luaState, -1, lua_error_msg)
    <span class="org-keyword">PRINT</span> *, <span class="org-string">"[ERROR] Lua had problems processing the file:"</span>
    <span class="org-keyword">PRINT</span> *, <span class="org-keyword">TRIM</span>(lua_error_msg)
  <span class="org-keyword">END IF</span>

  <span class="org-comment-delimiter">! </span><span class="org-comment">Ask Lua for the value of the variable `val'.  If there is no
</span>  <span class="org-comment-delimiter">! </span><span class="org-comment">variable named `val' the `nil' value will be pushed onto the
</span>  <span class="org-comment-delimiter">! </span><span class="org-comment">stack.
</span>  <span class="org-keyword">CALL</span> <span class="org-function-name">lua_getglobal</span>(luaState, <span class="org-string">"val"</span>)
  <span class="org-comment-delimiter">!</span><span class="org-comment">
</span>  <span class="org-keyword">IF</span>( lua_isnil(luaState, -1) ) <span class="org-keyword">THEN</span>
    <span class="org-keyword">PRINT</span> *, <span class="org-string">"[ERROR] `val' not found"</span>
    <span class="org-keyword">GOTO</span> <span class="org-constant">9999</span>
  <span class="org-keyword">END IF</span>

  <span class="org-comment-delimiter">! </span><span class="org-comment">So we found `var', but what if the value assigned to it wasn't a
</span>  <span class="org-comment-delimiter">! </span><span class="org-comment">number but i.e. a string.
</span>  <span class="org-keyword">IF</span>(<span class="org-keyword">.NOT.</span> lua_isnumber(luaState, -1) ) <span class="org-keyword">THEN</span>
    <span class="org-keyword">PRINT</span> *, <span class="org-string">"[ERROR] `val' is expected to refer to a number"</span>
    <span class="org-keyword">GOTO</span> <span class="org-constant">9999</span>
  <span class="org-keyword">END IF</span>
  val = lua_tonumber(luaState, -1)

  <span class="org-keyword">PRINT</span> *, <span class="org-string">"val:"</span>, val

<span class="org-constant">9999</span> <span class="org-keyword">CONTINUE</span> <span class="org-comment-delimiter">! </span><span class="org-comment">house keeping  
</span>  <span class="org-keyword">CALL</span> <span class="org-function-name">lua_close</span>(luaState)
<span class="org-keyword">END PROGRAM</span> <span class="org-function-name">get_val</span>     
</pre>



<p>
Once the file has be processed by the Lua VM it holds the values we
want.  We instruct Lua to take a disired value out of the VM and push
it on the stack.
</p><pre class="example">
stack: 
CALL lua_getglobal(luaState, "val") ! push 42
stack: |42|
</pre>

<p>We then take this value and pop it from the stack
</p><pre class="example">
stack: |42|
val = lua_tonumber(luaState, -1) ! pop
stack:
</pre>

<p>We'll get to the <code>-1</code> soon.  So the communication works like this
</p><pre class="example">
Lua VM -&gt; stack &lt;- our code
</pre>


<p>
Now regarding the <code>-1</code> TODO: read the lua docs and try to put it into
simple words.sc
</p>
</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Copyright and license of this document </h2>
<div class="outline-text-2" id="text-4">

<p>Copyright (C) 2011 by the f2k3-lua authors, see AUTHORS file.
Licensed under the MIT license, see LICENSE file.
</p>

</div>
</div>
<div id="postamble">
<p class="date">Date: 2011-05-03 00:12:40 CEST</p>
<p class="author">Author: Maik Beckmann &lt;beckmann.maik@googlemail.com&gt;</p>
<p class="creator">Org version 7.5 with Emacs version 23</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>
</div>
</div>
</body>
</html>
